#+TITLE: My Org-mode setup
#+AUTHOR: Matthew L. Fidler
** Key Bindings
:LOGBOOK:
CLOCK: [2011-12-15 Thu 08:51]--[2011-12-15 Thu 08:52] =>  0:01
:END:
Using ergo-emacs, I have the following custom key bindings setup for
emacs:
|-------+--------------------------------|
| Key   | For                            |
|-------+--------------------------------|
| C-M-m | Agenda                         |
| M-,   | Goto currently clocked in item |
| C-M-, | Org Clock in                   |
| M-m   | Org-Capture                    |
| M-<   | Clock in last task             |
|-------+--------------------------------|

#+BEGIN_SRC emacs-lisp
  (define-key ergoemacs-keymap (kbd "M-C-m") 'org-agenda)
  (define-key ergoemacs-keymap (kbd "M-m") 'org-capture)
  (define-key ergoemacs-keymap (kbd "M-,") 'org-clock-goto)
  (define-key ergoemacs-keymap (kbd "M-C-,") 'org-clock-in)
  (define-key ergoemacs-keymap (kbd "M-<") 'bh/clock-in-last-task)
  (define-key ergoemacs-keymap (kbd "<f9> I") 'bh/punch-in)
  (define-key ergoemacs-keymap (kbd "<f9> O") 'bh/punch-out)
#+END_SRC
  
** DONE Org mode display files
CLOSED: [2011-12-16 Fri 16:59]
- State "DONE"       from "STARTED"    [2011-12-16 Fri 16:59]
:LOGBOOK:
CLOCK: [2011-12-16 Fri 16:58]--[2011-12-16 Fri 16:59] =>  0:01
CLOCK: [2011-12-16 Fri 16:45]--[2011-12-16 Fri 16:58] =>  0:13
:END:
Using iimage mode, See [[http://orgmode.org/worg/org-configs/org-config-examples.html#sec-2-2][iimage in org]].
- iimage 
#+BEGIN_SRC emacs-lisp
  (add-to-list 'iimage-mode-image-regex-alist
               (cons (concat "\\[\\[file:\\(~?" iimage-mode-image-filename-regex
                             "\\)\\]")  1))
  
  (defun org-toggle-iimage-in-org ()
    "display images in your org file"
    (interactive)
    (if (face-underline-p 'org-link)
        (set-face-underline-p 'org-link nil)
      (set-face-underline-p 'org-link t))
    (iimage-mode))
  (add-hook 'org-mode-hook 'org-toggle-iimage-in-org)
#+END_SRC


** STARTED Make org-mode do checklists like on the screen shots
:LOGBOOK:
CLOCK: [2011-12-16 Fri 16:37]--[2011-12-16 Fri 16:45] =>  0:08
:END:
